# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
brew 'git'
brew 'node'
brew 'wget'
brew 'tree'
brew 'mackup'

# Development
brew 'php70', args: ['with-debug', 'without-apache']
brew 'mariadb'

# Apps
cask 'iterm2'
# cask 'alfred'
cask 'google-chrome'
cask 'google-drive'
cask 'sequel-pro'
cask 'sublime-text'
cask 'filezilla'
cask 'postman'
cask 'gitkraken'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'